package com.example.lab5_1

import java.util.UUID

object TravelData {
    val travels = arrayListOf(
        Travel(
            id = UUID.randomUUID().toString(),
            place = "Париж, Франція",
            dateTravel = "2024-09-15",
            interectingPlaces = listOf("Ейфелева вежа", "Лувр", "Собор Паризької Богоматері"),
            expirience = listOf(
                "Побачили чудові краєвиди з Ейфелевої вежі.",
                "Відвідали знаменитий музей Лувр.",
                "Насолодилися прогулянкою вздовж Сени та відвідали історичні місця."
            )
        ),
        Travel(
            id = UUID.randomUUID().toString(),
            place = "Токіо, Японія",
            dateTravel = "2023-04-10",
            interectingPlaces = listOf("Сенсодзі", "Імператорський палац", "Шибуя"),
            expirience = listOf(
                "Відвідали найстаріший храм Сенсодзі.",
                "Прогулялися садом біля Імператорського палацу.",
                "Насолодилися видом на перехрестя Шибуя та нічне життя Токіо."
            )
        ),
        Travel(
            id = UUID.randomUUID().toString(),
            place = "Нью-Йорк, США",
            dateTravel = "2022-12-20",
            interectingPlaces = listOf("Центральний парк", "Статуя Свободи", "Таймс-сквер"),
            expirience = listOf(
                "Прогулялися зимовим Центральним парком.",
                "Піднялися на острів Ліберті, щоб побачити Статую Свободи.",
                "Відсвяткували Новий рік на Таймс-сквер."
            )
        ),
        Travel(
            id = UUID.randomUUID().toString(),
            place = "Рим, Італія",
            dateTravel = "2023-05-05",
            interectingPlaces = listOf("Колізей", "Фонтан Треві", "Ватикан"),
            expirience = listOf(
                "Відвідали історичний Колізей.",
                "Кинули монетку у фонтан Треві.",
                "Насолодилися екскурсією до Ватикану та Собору Святого Петра."
            )
        ),
        Travel(
            id = UUID.randomUUID().toString(),
            place = "Сідней, Австралія",
            dateTravel = "2024-03-22",
            interectingPlaces = listOf("Сіднейський оперний театр", "Гавань Дарлінг", "Бонді-біч"),
            expirience = listOf(
                "Подивилися виставу в Сіднейському оперному театрі.",
                "Провели вечір у Гавані Дарлінг.",
                "Насолодилися серфінгом та відпочинком на Бонді-біч."
            )
        ),
        Travel(
            id = UUID.randomUUID().toString(),
            place = "Київ, Україна",
            dateTravel = "2023-08-20",
            interectingPlaces = listOf("Софійський собор", "Майдан Незалежності", "Андріївський узвіз"),
            expirience = listOf(
                "Відвідали Софійський собор і ознайомилися з історією міста.",
                "Провели час на Майдані Незалежності, вивчаючи культурні пам'ятки.",
                "Прогулялися Андріївським узвозом і відвідали місцеві художні галереї."
            )
        )
    )
}